[Survived] BlockStatement
controllers/orderController.js:4:35
 const prisma = require('../config/db');
 
 // Helper to generate order numbers based on datetime to prevent overlaps
-const generateOrderNumber = () => {
-    const dateStr = new Date().toISOString().replace(/[-:T.]/g, '').slice(0, 14); // YYYYMMDDHHMMSS
-    const randomSuffix = Math.floor(1000 + Math.random() * 9000); // 4-digit random number
-    return `#ORD-${dateStr}-${randomSuffix}`;
-};
+const generateOrderNumber = () => {};
 
 // @desc    Create new order

[Survived] MethodExpression
controllers/orderController.js:5:21
 
 // Helper to generate order numbers based on datetime to prevent overlaps
 const generateOrderNumber = () => {
-    const dateStr = new Date().toISOString().replace(/[-:T.]/g, '').slice(0, 14); // YYYYMMDDHHMMSS
+    const dateStr = new Date().toISOString().replace(/[-:T.]/g, ''); // YYYYMMDDHHMMSS
     const randomSuffix = Math.floor(1000 + Math.random() * 9000); // 4-digit random number
     return `#ORD-${dateStr}-${randomSuffix}`;

[Survived] ArithmeticOperator
controllers/orderController.js:6:37
 // Helper to generate order numbers based on datetime to prevent overlaps
 const generateOrderNumber = () => {
     const dateStr = new Date().toISOString().replace(/[-:T.]/g, '').slice(0, 14); // YYYYMMDDHHMMSS
-    const randomSuffix = Math.floor(1000 + Math.random() * 9000); // 4-digit random number
+    const randomSuffix = Math.floor(1000 - Math.random() * 9000); // 4-digit random number
     return `#ORD-${dateStr}-${randomSuffix}`;
 };

[Survived] ArithmeticOperator
controllers/orderController.js:6:44
 // Helper to generate order numbers based on datetime to prevent overlaps
 const generateOrderNumber = () => {
     const dateStr = new Date().toISOString().replace(/[-:T.]/g, '').slice(0, 14); // YYYYMMDDHHMMSS
-    const randomSuffix = Math.floor(1000 + Math.random() * 9000); // 4-digit random number
+    const randomSuffix = Math.floor(1000 + Math.random() / 9000); // 4-digit random number
     return `#ORD-${dateStr}-${randomSuffix}`;
 };

[Survived] StringLiteral
controllers/orderController.js:7:12
 const generateOrderNumber = () => {
     const dateStr = new Date().toISOString().replace(/[-:T.]/g, '').slice(0, 14); // YYYYMMDDHHMMSS
     const randomSuffix = Math.floor(1000 + Math.random() * 9000); // 4-digit random number
-    return `#ORD-${dateStr}-${randomSuffix}`;
+    return ``;
 };
 

[Survived] ObjectLiteral
controllers/orderController.js:23:20
 
         // Validate restaurant and check payment settings
         const restaurant = await prisma.restaurant.findUnique({ 
-            where: { id: restaurantId },
+            where: {},
             include: { paymentSettings: true }
         });

[Survived] BooleanLiteral
controllers/orderController.js:24:41
         // Validate restaurant and check payment settings
         const restaurant = await prisma.restaurant.findUnique({ 
             where: { id: restaurantId },
-            include: { paymentSettings: true }
+            include: { paymentSettings: false }
         });
         if (!restaurant) {

[Killed] BlockStatement
controllers/orderController.js:26:26
             where: { id: restaurantId },
             include: { paymentSettings: true }
         });
-        if (!restaurant) {
-            return res.status(404).json({ success: false, message: 'Restaurant not found' });
-        }
+        if (!restaurant) {}
 
         // Validate Cash payment method
killedBy: createOrder 404 when restaurant does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/orderController.js:26:13
             where: { id: restaurantId },
             include: { paymentSettings: true }
         });
-        if (!restaurant) {
+        if (restaurant) {
             return res.status(404).json({ success: false, message: 'Restaurant not found' });
         }
killedBy: createOrder 404 when restaurant does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/orderController.js:27:52
             include: { paymentSettings: true }
         });
         if (!restaurant) {
-            return res.status(404).json({ success: false, message: 'Restaurant not found' });
+            return res.status(404).json({ success: true, message: 'Restaurant not found' });
         }
 
killedBy: createOrder 404 when restaurant does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "Restaurant not found", "success": true}

Number of calls: 1

[Killed] ObjectLiteral
controllers/orderController.js:27:41
             include: { paymentSettings: true }
         });
         if (!restaurant) {
-            return res.status(404).json({ success: false, message: 'Restaurant not found' });
+            return res.status(404).json({});
         }
 
killedBy: createOrder 404 when restaurant does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {}

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:31:33
         }
 
         // Validate Cash payment method
-        const requestedMethod = paymentMethod || 'CASH';
+        const requestedMethod = true;
         if (requestedMethod === 'CASH') {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
killedBy: createOrder 400 when CASH is disabled by restaurant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:31:33
         }
 
         // Validate Cash payment method
-        const requestedMethod = paymentMethod || 'CASH';
+        const requestedMethod = false;
         if (requestedMethod === 'CASH') {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
killedBy: createOrder 400 when CASH is disabled by restaurant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:32:13
 
         // Validate Cash payment method
         const requestedMethod = paymentMethod || 'CASH';
-        if (requestedMethod === 'CASH') {
+        if (false) {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
                 return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
killedBy: createOrder 400 when CASH is disabled by restaurant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/orderController.js:32:13
 
         // Validate Cash payment method
         const requestedMethod = paymentMethod || 'CASH';
-        if (requestedMethod === 'CASH') {
+        if (requestedMethod !== 'CASH') {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
                 return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
killedBy: createOrder 400 when CASH is disabled by restaurant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] LogicalOperator
controllers/orderController.js:33:17
         // Validate Cash payment method
         const requestedMethod = paymentMethod || 'CASH';
         if (requestedMethod === 'CASH') {
-            if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
+            if (restaurant.paymentSettings || restaurant.paymentSettings.cashEnabled === false) {
                 return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
             }
killedBy: createOrder CASH accepted when cashEnabled is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:33:17
         // Validate Cash payment method
         const requestedMethod = paymentMethod || 'CASH';
         if (requestedMethod === 'CASH') {
-            if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
+            if (false) {
                 return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
             }
killedBy: createOrder 400 when CASH is disabled by restaurant
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] BooleanLiteral
controllers/orderController.js:34:56
         const requestedMethod = paymentMethod || 'CASH';
         if (requestedMethod === 'CASH') {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
-                return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
+                return res.status(400).json({ success: true, message: 'Cash on Delivery is not accepted by this restaurant.' });
             }
         }

[Survived] ObjectLiteral
controllers/orderController.js:34:45
         const requestedMethod = paymentMethod || 'CASH';
         if (requestedMethod === 'CASH') {
             if (restaurant.paymentSettings && restaurant.paymentSettings.cashEnabled === false) {
-                return res.status(400).json({ success: false, message: 'Cash on Delivery is not accepted by this restaurant.' });
+                return res.status(400).json({});
             }
         }

[Survived] ArrowFunction
controllers/orderController.js:39:42
         }
 
         // Map items to format expected by Prisma nested write
-        const orderItemsData = items.map(item => ({
-            menuItemId: item.menuItemId,
-            name: item.name,
-            quantity: item.quantity,
-            price: item.price,
-            modifiers: item.modifiers || null
-        }));
+        const orderItemsData = items.map(() => undefined);
 
         const order = await prisma.order.create({

[Survived] ObjectLiteral
controllers/orderController.js:39:51
         }
 
         // Map items to format expected by Prisma nested write
-        const orderItemsData = items.map(item => ({
-            menuItemId: item.menuItemId,
-            name: item.name,
-            quantity: item.quantity,
-            price: item.price,
-            modifiers: item.modifiers || null
-        }));
+        const orderItemsData = items.map(item => ({}));
 
         const order = await prisma.order.create({

[Survived] ConditionalExpression
controllers/orderController.js:44:24
             name: item.name,
             quantity: item.quantity,
             price: item.price,
-            modifiers: item.modifiers || null
+            modifiers: true
         }));
 

[Survived] ConditionalExpression
controllers/orderController.js:44:24
             name: item.name,
             quantity: item.quantity,
             price: item.price,
-            modifiers: item.modifiers || null
+            modifiers: false
         }));
 

[Killed] EqualityOperator
controllers/orderController.js:53:24
                 restaurantId,
                 customerId: req.user.id,
                 type,
-                table: type === 'DINEIN' ? table : null,
+                table: type !== 'DINEIN' ? table : null,
                 subtotal,
                 deliveryFee: deliveryFee || 0,
killedBy: createOrder table is null for DELIVERY orders even when table is provided
statusReason: Error: expect(received).toBeNull()

Received: "T5"

[Killed] ConditionalExpression
controllers/orderController.js:53:24
                 restaurantId,
                 customerId: req.user.id,
                 type,
-                table: type === 'DINEIN' ? table : null,
+                table: false ? table : null,
                 subtotal,
                 deliveryFee: deliveryFee || 0,
killedBy: createOrder table is set for DINEIN orders
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "T5"
Received: null

[Killed] ConditionalExpression
controllers/orderController.js:55:30
                 type,
                 table: type === 'DINEIN' ? table : null,
                 subtotal,
-                deliveryFee: deliveryFee || 0,
+                deliveryFee: false,
                 taxes: taxes || 0,
                 platformFee: platformFee || 0,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: false

[Killed] ConditionalExpression
controllers/orderController.js:55:30
                 type,
                 table: type === 'DINEIN' ? table : null,
                 subtotal,
-                deliveryFee: deliveryFee || 0,
+                deliveryFee: true,
                 taxes: taxes || 0,
                 platformFee: platformFee || 0,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: true

[Killed] ConditionalExpression
controllers/orderController.js:56:24
                 table: type === 'DINEIN' ? table : null,
                 subtotal,
                 deliveryFee: deliveryFee || 0,
-                taxes: taxes || 0,
+                taxes: true,
                 platformFee: platformFee || 0,
                 total,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: true

[Killed] LogicalOperator
controllers/orderController.js:56:24
                 table: type === 'DINEIN' ? table : null,
                 subtotal,
                 deliveryFee: deliveryFee || 0,
-                taxes: taxes || 0,
+                taxes: taxes && 0,
                 platformFee: platformFee || 0,
                 total,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] LogicalOperator
controllers/orderController.js:57:30
                 subtotal,
                 deliveryFee: deliveryFee || 0,
                 taxes: taxes || 0,
-                platformFee: platformFee || 0,
+                platformFee: platformFee && 0,
                 total,
                 deliveryAddress: deliveryAddress ? JSON.stringify(deliveryAddress) : null,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
controllers/orderController.js:57:30
                 subtotal,
                 deliveryFee: deliveryFee || 0,
                 taxes: taxes || 0,
-                platformFee: platformFee || 0,
+                platformFee: false,
                 total,
                 deliveryAddress: deliveryAddress ? JSON.stringify(deliveryAddress) : null,
killedBy: createOrder defaults deliveryFee, taxes, platformFee to 0 when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: false

[Killed] LogicalOperator
controllers/orderController.js:61:32
                 total,
                 deliveryAddress: deliveryAddress ? JSON.stringify(deliveryAddress) : null,
                 customerNotes,
-                paymentMethod: paymentMethod || 'CASH',
+                paymentMethod: paymentMethod && 'CASH',
                 items: {
                     create: orderItemsData
killedBy: createOrder defaults paymentMethod to CASH when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CASH"
Received: undefined

[Killed] ConditionalExpression
controllers/orderController.js:61:32
                 total,
                 deliveryAddress: deliveryAddress ? JSON.stringify(deliveryAddress) : null,
                 customerNotes,
-                paymentMethod: paymentMethod || 'CASH',
+                paymentMethod: false,
                 items: {
                     create: orderItemsData
killedBy: createOrder defaults paymentMethod to CASH when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CASH"
Received: false

[Survived] BooleanLiteral
controllers/orderController.js:67:24
                 }
             },
             include: {
-                items: true,
+                items: false,
                 restaurant: {
                     select: { name: true, logo: true }

[Survived] BooleanLiteral
controllers/orderController.js:69:37
             include: {
                 items: true,
                 restaurant: {
-                    select: { name: true, logo: true }
+                    select: { name: false, logo: true }
                 }
             }

[Survived] BooleanLiteral
controllers/orderController.js:69:49
             include: {
                 items: true,
                 restaurant: {
-                    select: { name: true, logo: true }
+                    select: { name: true, logo: false }
                 }
             }

[Survived] ObjectLiteral
controllers/orderController.js:76:20
 
         // Refetch with customer info for socket emit
         const orderWithCustomer = await prisma.order.findUnique({
-            where: { id: order.id },
+            where: {},
             include: {
                 items: true,

[Survived] BooleanLiteral
controllers/orderController.js:79:59
             where: { id: order.id },
             include: {
                 items: true,
-                restaurant: { select: { name: true, logo: true } },
+                restaurant: { select: { name: true, logo: false } },
                 customer: { select: { fullName: true, phone: true } }
             }

[Survived] BooleanLiteral
controllers/orderController.js:79:47
             where: { id: order.id },
             include: {
                 items: true,
-                restaurant: { select: { name: true, logo: true } },
+                restaurant: { select: { name: false, logo: true } },
                 customer: { select: { fullName: true, phone: true } }
             }

[Survived] BooleanLiteral
controllers/orderController.js:80:62
             include: {
                 items: true,
                 restaurant: { select: { name: true, logo: true } },
-                customer: { select: { fullName: true, phone: true } }
+                customer: { select: { fullName: true, phone: false } }
             }
         });

[Survived] BooleanLiteral
controllers/orderController.js:80:49
             include: {
                 items: true,
                 restaurant: { select: { name: true, logo: true } },
-                customer: { select: { fullName: true, phone: true } }
+                customer: { select: { fullName: false, phone: true } }
             }
         });

[Survived] StringLiteral
controllers/orderController.js:85:32
         });
 
         // --- Socket.IO Real-time Emit ---
-        const io = req.app.get('io');
+        const io = req.app.get("");
         if (io) {
             io.to(`restaurant_${restaurantId}`).emit('newOrder', orderWithCustomer);

[Killed] ConditionalExpression
controllers/orderController.js:86:13
 
         // --- Socket.IO Real-time Emit ---
         const io = req.app.get('io');
-        if (io) {
+        if (true) {
             io.to(`restaurant_${restaurantId}`).emit('newOrder', orderWithCustomer);
         }
killedBy: createOrder CASH accepted when cashEnabled is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 201
Received: 500

Number of calls: 1

[Survived] ConditionalExpression
controllers/orderController.js:86:13
 
         // --- Socket.IO Real-time Emit ---
         const io = req.app.get('io');
-        if (io) {
+        if (false) {
             io.to(`restaurant_${restaurantId}`).emit('newOrder', orderWithCustomer);
         }

[Survived] BooleanLiteral
controllers/orderController.js:90:41
             io.to(`restaurant_${restaurantId}`).emit('newOrder', orderWithCustomer);
         }
 
-        res.status(201).json({ success: true, data: orderWithCustomer });
+        res.status(201).json({ success: false, data: orderWithCustomer });
     } catch (error) {
         console.error("ORDER CREATION ERROR:", error);

[Survived] ObjectLiteral
controllers/orderController.js:90:30
             io.to(`restaurant_${restaurantId}`).emit('newOrder', orderWithCustomer);
         }
 
-        res.status(201).json({ success: true, data: orderWithCustomer });
+        res.status(201).json({});
     } catch (error) {
         console.error("ORDER CREATION ERROR:", error);

[NoCoverage] BlockStatement
controllers/orderController.js:91:21
         }
 
         res.status(201).json({ success: true, data: orderWithCustomer });
-    } catch (error) {
-        console.error("ORDER CREATION ERROR:", error);
-        res.status(500).json({ success: false, message: error.message || 'Server error creating order', errorDetails: error });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/orderController.js:93:41
         res.status(201).json({ success: true, data: orderWithCustomer });
     } catch (error) {
         console.error("ORDER CREATION ERROR:", error);
-        res.status(500).json({ success: false, message: error.message || 'Server error creating order', errorDetails: error });
+        res.status(500).json({ success: true, message: error.message || 'Server error creating order', errorDetails: error });
     }
 };

[NoCoverage] ConditionalExpression
controllers/orderController.js:93:57
         res.status(201).json({ success: true, data: orderWithCustomer });
     } catch (error) {
         console.error("ORDER CREATION ERROR:", error);
-        res.status(500).json({ success: false, message: error.message || 'Server error creating order', errorDetails: error });
+        res.status(500).json({ success: false, message: false, errorDetails: error });
     }
 };

[Killed] BlockStatement
controllers/orderController.js:104:43
     try {
         let whereClause = {};
 
-        if (req.user.role === 'CUSTOMER') {
-            whereClause.customerId = req.user.id;
-        } else if (req.user.role === 'RESTAURANT_OWNER') {
+        if (req.user.role === 'CUSTOMER') {} else if (req.user.role === 'RESTAURANT_OWNER') {
             // A restaurant owner might own multiple restaurants, or we pass a query param
             const { restaurantId } = req.query;
killedBy: getOrders CUSTOMER gets only their own orders (whereClause uses customerId)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "u1"
Received: undefined

[Killed] ConditionalExpression
controllers/orderController.js:104:13
     try {
         let whereClause = {};
 
-        if (req.user.role === 'CUSTOMER') {
+        if (true) {
             whereClause.customerId = req.user.id;
         } else if (req.user.role === 'RESTAURANT_OWNER') {
killedBy: getOrders RESTAURANT_OWNER sees orders across all their restaurants
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"in": ["r1", "r2"]}
Received: undefined

[Killed] ConditionalExpression
controllers/orderController.js:106:20
 
         if (req.user.role === 'CUSTOMER') {
             whereClause.customerId = req.user.id;
-        } else if (req.user.role === 'RESTAURANT_OWNER') {
+        } else if (false) {
             // A restaurant owner might own multiple restaurants, or we pass a query param
             const { restaurantId } = req.query;
killedBy: getOrders RESTAURANT_OWNER sees orders across all their restaurants
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"in": ["r1", "r2"]}
Received: undefined

[Killed] EqualityOperator
controllers/orderController.js:106:20
 
         if (req.user.role === 'CUSTOMER') {
             whereClause.customerId = req.user.id;
-        } else if (req.user.role === 'RESTAURANT_OWNER') {
+        } else if (req.user.role !== 'RESTAURANT_OWNER') {
             // A restaurant owner might own multiple restaurants, or we pass a query param
             const { restaurantId } = req.query;
killedBy: getOrders RESTAURANT_OWNER sees orders across all their restaurants
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"in": ["r1", "r2"]}
Received: undefined

[Survived] ObjectLiteral
controllers/orderController.js:110:71
             // A restaurant owner might own multiple restaurants, or we pass a query param
             const { restaurantId } = req.query;
 
-            const ownerRestaurants = await prisma.restaurant.findMany({
-                where: { ownerId: req.user.id },
-                select: { id: true }
-            });
+            const ownerRestaurants = await prisma.restaurant.findMany({});
             const ownerRestIds = ownerRestaurants.map(r => r.id);
 

[Survived] BooleanLiteral
controllers/orderController.js:112:31
 
             const ownerRestaurants = await prisma.restaurant.findMany({
                 where: { ownerId: req.user.id },
-                select: { id: true }
+                select: { id: false }
             });
             const ownerRestIds = ownerRestaurants.map(r => r.id);

[Killed] ArrowFunction
controllers/orderController.js:114:55
                 where: { ownerId: req.user.id },
                 select: { id: true }
             });
-            const ownerRestIds = ownerRestaurants.map(r => r.id);
+            const ownerRestIds = ownerRestaurants.map(() => undefined);
 
             whereClause.restaurantId = restaurantId ? restaurantId : { in: ownerRestIds };
killedBy: getOrders RESTAURANT_OWNER sees orders across all their restaurants
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "in": Array [
-     "r1",

[Survived] ObjectLiteral
controllers/orderController.js:121:22
 
         const orders = await prisma.order.findMany({
             where: whereClause,
-            orderBy: { createdAt: 'desc' },
+            orderBy: {},
             include: {
                 items: true,

[Survived] BooleanLiteral
controllers/orderController.js:125:37
             include: {
                 items: true,
                 restaurant: {
-                    select: { name: true, logo: true, address: true }
+                    select: { name: false, logo: true, address: true }
                 },
                 customer: {

[Survived] BooleanLiteral
controllers/orderController.js:125:49
             include: {
                 items: true,
                 restaurant: {
-                    select: { name: true, logo: true, address: true }
+                    select: { name: true, logo: false, address: true }
                 },
                 customer: {

[Survived] BooleanLiteral
controllers/orderController.js:128:41
                     select: { name: true, logo: true, address: true }
                 },
                 customer: {
-                    select: { fullName: true, phone: true }
+                    select: { fullName: false, phone: true }
                 }
             }

[Survived] BooleanLiteral
controllers/orderController.js:128:54
                     select: { name: true, logo: true, address: true }
                 },
                 customer: {
-                    select: { fullName: true, phone: true }
+                    select: { fullName: true, phone: false }
                 }
             }

[Killed] BooleanLiteral
controllers/orderController.js:133:41
             }
         });
 
-        res.status(200).json({ success: true, count: orders.length, data: orders });
+        res.status(200).json({ success: false, count: orders.length, data: orders });
     } catch (error) {
         console.error('GET ORDERS ERROR:', {
killedBy: getOrders returns 200 with count and data array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"count": 2, "success": true}
Received: {"count": 2, "data": [{"id": "o1"}, {"id": "o2"}], "success": false}

Number of calls: 1

[NoCoverage] BlockStatement
controllers/orderController.js:134:21
         });
 
         res.status(200).json({ success: true, count: orders.length, data: orders });
-    } catch (error) {
-        console.error('GET ORDERS ERROR:', {
-            message: error.message,
-            code: error.code,
-            meta: error.meta,
-            stack: error.stack
-        });
-        res.status(500).json({ success: false, message: error.message || 'Server error retrieving orders' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/orderController.js:141:41
             meta: error.meta,
             stack: error.stack
         });
-        res.status(500).json({ success: false, message: error.message || 'Server error retrieving orders' });
+        res.status(500).json({ success: true, message: error.message || 'Server error retrieving orders' });
     }
 };
