[NoCoverage] ConditionalExpression
controllers/orderController.js:141:57
             meta: error.meta,
             stack: error.stack
         });
-        res.status(500).json({ success: false, message: error.message || 'Server error retrieving orders' });
+        res.status(500).json({ success: false, message: true });
     }
 };

[Survived] BooleanLiteral
controllers/orderController.js:155:36
         // Find order to check ownership
         const order = await prisma.order.findUnique({
             where: { id: req.params.id },
-            include: { restaurant: true }
+            include: { restaurant: false }
         });
 

[Survived] ObjectLiteral
controllers/orderController.js:155:22
         // Find order to check ownership
         const order = await prisma.order.findUnique({
             where: { id: req.params.id },
-            include: { restaurant: true }
+            include: {}
         });
 

[Killed] ConditionalExpression
controllers/orderController.js:158:13
             include: { restaurant: true }
         });
 
-        if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
+        if (true) return res.status(404).json({ success: false, message: 'Order not found' });
 
         if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
killedBy: updateOrderStatus 403 when user is not the restaurant owner AND not ADMIN
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:158:13
             include: { restaurant: true }
         });
 
-        if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
+        if (false) return res.status(404).json({ success: false, message: 'Order not found' });
 
         if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
killedBy: updateOrderStatus 404 when order does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:160:57
 
         if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
 
-        if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
+        if (order.restaurant.ownerId !== req.user.id && true) {
             return res.status(403).json({ success: false, message: 'Not authorized' });
         }
killedBy: updateOrderStatus ADMIN can update any order regardless of ownership
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Killed] EqualityOperator
controllers/orderController.js:160:13
 
         if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
 
-        if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
+        if (order.restaurant.ownerId === req.user.id && req.user.role !== 'ADMIN') {
             return res.status(403).json({ success: false, message: 'Not authorized' });
         }
killedBy: updateOrderStatus 403 when user is not the restaurant owner AND not ADMIN
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Survived] BooleanLiteral
controllers/orderController.js:161:52
         if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
 
         if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
-            return res.status(403).json({ success: false, message: 'Not authorized' });
+            return res.status(403).json({ success: true, message: 'Not authorized' });
         }
 

[Survived] ObjectLiteral
controllers/orderController.js:164:29
             return res.status(403).json({ success: false, message: 'Not authorized' });
         }
 
-        const updatedData = { status };
+        const updatedData = {};
         if (prepTime && status === 'ACCEPTED') {
             updatedData.prepTime = parseInt(prepTime);

[Killed] ConditionalExpression
controllers/orderController.js:165:25
         }
 
         const updatedData = { status };
-        if (prepTime && status === 'ACCEPTED') {
+        if (prepTime && true) {
             updatedData.prepTime = parseInt(prepTime);
 
killedBy: updateOrderStatus prepTime is NOT stored when status is not ACCEPTED
statusReason: Error: expect(received).toBeUndefined()

Received: 20

[Killed] ConditionalExpression
controllers/orderController.js:165:13
         }
 
         const updatedData = { status };
-        if (prepTime && status === 'ACCEPTED') {
+        if (false) {
             updatedData.prepTime = parseInt(prepTime);
 
killedBy: updateOrderStatus prepTime is parsed and stored when status is ACCEPTED
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: undefined

[Killed] ConditionalExpression
controllers/orderController.js:170:79
 
             // Calculate estimated delivery time based on prep time + 15 mins for delivery approx
             const estTime = new Date();
-            estTime.setMinutes(estTime.getMinutes() + updatedData.prepTime + (order.type === 'DELIVERY' ? 15 : 0));
+            estTime.setMinutes(estTime.getMinutes() + updatedData.prepTime + (true ? 15 : 0));
             updatedData.estimatedDeliveryTime = estTime;
         }
killedBy: updateOrderStatus PICKUP orders do NOT add the 15 min delivery buffer
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 1
Received:    15

[Killed] MethodExpression
controllers/orderController.js:170:13
 
             // Calculate estimated delivery time based on prep time + 15 mins for delivery approx
             const estTime = new Date();
-            estTime.setMinutes(estTime.getMinutes() + updatedData.prepTime + (order.type === 'DELIVERY' ? 15 : 0));
+            estTime.setHours(estTime.getMinutes() + updatedData.prepTime + (order.type === 'DELIVERY' ? 15 : 0));
             updatedData.estimatedDeliveryTime = estTime;
         }
killedBy: updateOrderStatus DELIVERY orders add 15 min buffer to estimated delivery time
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 14
Received:    -420

[Survived] BooleanLiteral
controllers/orderController.js:178:43
             where: { id: req.params.id },
             data: updatedData,
             include: {
-                customer: { select: { id: true, fullName: true, phone: true } },
+                customer: { select: { id: false, fullName: true, phone: true } },
                 restaurant: { select: { id: true, name: true } },
                 items: true

[Survived] BooleanLiteral
controllers/orderController.js:178:59
             where: { id: req.params.id },
             data: updatedData,
             include: {
-                customer: { select: { id: true, fullName: true, phone: true } },
+                customer: { select: { id: true, fullName: false, phone: true } },
                 restaurant: { select: { id: true, name: true } },
                 items: true

[Survived] BooleanLiteral
controllers/orderController.js:179:57
             data: updatedData,
             include: {
                 customer: { select: { id: true, fullName: true, phone: true } },
-                restaurant: { select: { id: true, name: true } },
+                restaurant: { select: { id: true, name: false } },
                 items: true
             }

[Survived] BooleanLiteral
controllers/orderController.js:179:45
             data: updatedData,
             include: {
                 customer: { select: { id: true, fullName: true, phone: true } },
-                restaurant: { select: { id: true, name: true } },
+                restaurant: { select: { id: false, name: true } },
                 items: true
             }

[Survived] BooleanLiteral
controllers/orderController.js:180:24
             include: {
                 customer: { select: { id: true, fullName: true, phone: true } },
                 restaurant: { select: { id: true, name: true } },
-                items: true
+                items: false
             }
         });

[NoCoverage] BlockStatement
controllers/orderController.js:186:17
 
         // --- Socket.IO Real-time Emit ---
         const io = req.app.get('io');
-        if (io) {
-            // Notify customer specific order room
-            io.to(`order_${order.id}`).emit('orderStatusUpdate', updatedOrder);
-            // Notify restaurant room
-            io.to(`restaurant_${order.restaurantId}`).emit('orderStatusUpdate', updatedOrder);
-        }
+        if (io) {}
 
         res.status(200).json({ success: true, data: updatedOrder });

[NoCoverage] StringLiteral
controllers/orderController.js:190:60
             // Notify customer specific order room
             io.to(`order_${order.id}`).emit('orderStatusUpdate', updatedOrder);
             // Notify restaurant room
-            io.to(`restaurant_${order.restaurantId}`).emit('orderStatusUpdate', updatedOrder);
+            io.to(`restaurant_${order.restaurantId}`).emit("", updatedOrder);
         }
 

[Survived] BooleanLiteral
controllers/orderController.js:193:41
             io.to(`restaurant_${order.restaurantId}`).emit('orderStatusUpdate', updatedOrder);
         }
 
-        res.status(200).json({ success: true, data: updatedOrder });
+        res.status(200).json({ success: false, data: updatedOrder });
     } catch (error) {
         console.error(error);

[NoCoverage] BlockStatement
controllers/orderController.js:194:21
         }
 
         res.status(200).json({ success: true, data: updatedOrder });
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ success: false, message: 'Server error updating order status' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/orderController.js:196:41
         res.status(200).json({ success: true, data: updatedOrder });
     } catch (error) {
         console.error(error);
-        res.status(500).json({ success: false, message: 'Server error updating order status' });
+        res.status(500).json({ success: true, message: 'Server error updating order status' });
     }
 };

[Killed] BlockStatement
controllers/orderController.js:204:9
 // @route   GET /api/orders/:id
 // @access  Private
 exports.getOrderById = async (req, res) => {
-    try {
-        const order = await prisma.order.findUnique({
-            where: { id: req.params.id },
-            include: {
-                restaurant: true,
-                customer: { select: { id: true, fullName: true, phone: true } },
-                items: { include: { menuItem: true } }
-            }
-        });
-
-        if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
-
-        // Check if user has permission to view
-        const isCustomer = order.customerId === req.user.id;
-        const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
-            .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
-
-        if (!isCustomer && !isOwnerOrAdmin) {
-            return res.status(403).json({ success: false, message: 'Not authorized to view this order' });
-        }
-
-        res.status(200).json({ success: true, data: order });
-    } catch (error) {
+    try {} catch (error) {
         console.error(error);
         res.status(500).json({ success: false, message: 'Server error fetching order' });
killedBy: getOrderById 404 when order not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0

[Survived] BooleanLiteral
controllers/orderController.js:208:29
         const order = await prisma.order.findUnique({
             where: { id: req.params.id },
             include: {
-                restaurant: true,
+                restaurant: false,
                 customer: { select: { id: true, fullName: true, phone: true } },
                 items: { include: { menuItem: true } }

[Survived] BooleanLiteral
controllers/orderController.js:209:43
             where: { id: req.params.id },
             include: {
                 restaurant: true,
-                customer: { select: { id: true, fullName: true, phone: true } },
+                customer: { select: { id: false, fullName: true, phone: true } },
                 items: { include: { menuItem: true } }
             }

[Survived] BooleanLiteral
controllers/orderController.js:209:72
             where: { id: req.params.id },
             include: {
                 restaurant: true,
-                customer: { select: { id: true, fullName: true, phone: true } },
+                customer: { select: { id: true, fullName: true, phone: false } },
                 items: { include: { menuItem: true } }
             }

[Survived] BooleanLiteral
controllers/orderController.js:210:47
             include: {
                 restaurant: true,
                 customer: { select: { id: true, fullName: true, phone: true } },
-                items: { include: { menuItem: true } }
+                items: { include: { menuItem: false } }
             }
         });

[Killed] ConditionalExpression
controllers/orderController.js:217:28
         if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
 
         // Check if user has permission to view
-        const isCustomer = order.customerId === req.user.id;
+        const isCustomer = false;
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
             .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
killedBy: getOrderById customer can view their own order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Killed] EqualityOperator
controllers/orderController.js:217:28
         if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
 
         // Check if user has permission to view
-        const isCustomer = order.customerId === req.user.id;
+        const isCustomer = order.customerId !== req.user.id;
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
             .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
killedBy: getOrderById customer can view their own order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:219:24
         // Check if user has permission to view
         const isCustomer = order.customerId === req.user.id;
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
-            .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
+            .then(r => true);
 
         if (!isCustomer && !isOwnerOrAdmin) {
killedBy: getOrderById 403 when user is neither the customer nor owner nor ADMIN
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 403
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/orderController.js:219:24
         // Check if user has permission to view
         const isCustomer = order.customerId === req.user.id;
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
-            .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
+            .then(r => false);
 
         if (!isCustomer && !isOwnerOrAdmin) {
killedBy: getOrderById restaurant owner can view their own restaurant order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Killed] LogicalOperator
controllers/orderController.js:221:13
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
             .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
 
-        if (!isCustomer && !isOwnerOrAdmin) {
+        if (!isCustomer || !isOwnerOrAdmin) {
             return res.status(403).json({ success: false, message: 'Not authorized to view this order' });
         }
killedBy: getOrderById customer can view their own order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Killed] BooleanLiteral
controllers/orderController.js:221:13
         const isOwnerOrAdmin = await prisma.restaurant.findUnique({ where: { id: order.restaurantId } })
             .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
 
-        if (!isCustomer && !isOwnerOrAdmin) {
+        if (isCustomer && !isOwnerOrAdmin) {
             return res.status(403).json({ success: false, message: 'Not authorized to view this order' });
         }
killedBy: getOrderById customer can view their own order
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 403

Number of calls: 1

[Survived] BooleanLiteral
controllers/orderController.js:222:52
             .then(r => r?.ownerId === req.user.id || req.user.role === 'ADMIN');
 
         if (!isCustomer && !isOwnerOrAdmin) {
-            return res.status(403).json({ success: false, message: 'Not authorized to view this order' });
+            return res.status(403).json({ success: true, message: 'Not authorized to view this order' });
         }
 

[Survived] BooleanLiteral
controllers/orderController.js:225:41
             return res.status(403).json({ success: false, message: 'Not authorized to view this order' });
         }
 
-        res.status(200).json({ success: true, data: order });
+        res.status(200).json({ success: false, data: order });
     } catch (error) {
         console.error(error);

[NoCoverage] BlockStatement
controllers/orderController.js:226:21
         }
 
         res.status(200).json({ success: true, data: order });
-    } catch (error) {
-        console.error(error);
-        res.status(500).json({ success: false, message: 'Server error fetching order' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BooleanLiteral
controllers/orderController.js:228:41
         res.status(200).json({ success: true, data: order });
     } catch (error) {
         console.error(error);
-        res.status(500).json({ success: false, message: 'Server error fetching order' });
+        res.status(500).json({ success: true, message: 'Server error fetching order' });
     }
 };

[NoCoverage] StringLiteral
controllers/orderController.js:228:57
         res.status(200).json({ success: true, data: order });
     } catch (error) {
         console.error(error);
-        res.status(500).json({ success: false, message: 'Server error fetching order' });
+        res.status(500).json({ success: false, message: "" });
     }
 };
