[Killed] BooleanLiteral
controllers/orderController.js:158:60
             include: { restaurant: true }
         });
 
-        if (!order) return res.status(404).json({ success: false, message: 'Order not found' });
+        if (!order) return res.status(404).json({ success: true, message: 'Order not found' });
 
         if (order.restaurant.ownerId !== req.user.id && req.user.role !== 'ADMIN') {
killedBy: updateOrderStatus 404 when order does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Order not found", "success": false}
Received: {"message": "Order not found", "success": true}

Number of calls: 1

[Killed] ArithmeticOperator
controllers/orderController.js:170:32
 
             // Calculate estimated delivery time based on prep time + 15 mins for delivery approx
             const estTime = new Date();
-            estTime.setMinutes(estTime.getMinutes() + updatedData.prepTime + (order.type === 'DELIVERY' ? 15 : 0));
+            estTime.setMinutes(estTime.getMinutes() - updatedData.prepTime + (order.type === 'DELIVERY' ? 15 : 0));
             updatedData.estimatedDeliveryTime = estTime;
         }
killedBy: updateOrderStatus — boundary and mutation-killing tests [AOR] prepTime=30 is added not subtracted to estimate (kills + -> - on prepTime)
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 1777661451887
Received:   1777659651887
